Repository: Mohamed03-T/Notes-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Notes App
ar: تطبيق الملاحظات

source: Settings
ar: الإعدادات

# appearanceAndDisplay
source: Appearance & Display
ar: المظهر والعرض

source: Dark Mode
ar: المظهر الداكن

# darkModeSubtitle
source: Enable dark theme for the app
ar: تفعيل المظهر الداكن للتطبيق

source: Font Size
ar: حجم الخط

# fontSizeSubtitle
source: Medium
ar: متوسط

# languageAndRegion
source: Language & Region
ar: اللغة والمنطقة

source: Language
ar: اللغة

source: Timezone
ar: المنطقة الزمنية

# timezoneSubtitle
source: GMT+3 (Riyadh)
ar: GMT+3 (الرياض)

source: Notifications
ar: الإشعارات

source: Enable Notifications
ar: تفعيل الإشعارات

# enableNotificationsSubtitle
source: Receive reminder notifications
ar: استقبال إشعارات التذكير

# backupAndSync
source: Backup & Sync
ar: النسخ الاحتياطي والمزامنة

source: Auto Backup
ar: النسخ الاحتياطي التلقائي

# autoBackupSubtitle
source: Automatic note saving
ar: حفظ تلقائي للملاحظات

source: Export Data
ar: تصدير البيانات

source: Import Data
ar: استيراد البيانات

# importDataSubtitle
source: From external files
ar: من ملفات خارجية

# support
source: Support & Help
ar: الدعم والمساعدة

source: Help Center
ar: مركز المساعدة

# helpCenterSubtitle
source: FAQs and tutorials
ar: الأسئلة الشائعة والدروس

source: Contact Us
ar: تواصل معنا

source: About App
ar: حول التطبيق

source: Select Language
ar: اختر اللغة

source: Cancel
ar: إلغاء

source: Close
ar: إغلاق

# version
source: Version: 1.0.0
ar: الإصدار: 1.0.0

# developer
source: Developer: Mohamed03-T
ar: تطوير: Mohamed03-T

source: Dark mode enabled
ar: تم تفعيل المظهر الداكن

source: Light mode enabled
ar: تم تفعيل المظهر الفاتح

# fontSizeComingSoon
source: Font size options will be added soon
ar: سيتم إضافة خيارات حجم الخط قريباً

# timezoneComingSoon
source: Timezone options will be added soon
ar: سيتم إضافة خيارات المنطقة الزمنية قريباً

# exportComingSoon
source: Export options will be added soon
ar: سيتم إضافة خيارات التصدير قريباً

# importComingSoon
source: Import options will be added soon
ar: سيتم إضافة خيارات الاستيراد قريباً

# helpComingSoon
source: Help center will be added soon
ar: سيتم إضافة مركز المساعدة قريباً

# contactComingSoon
source: Contact options will be added soon
ar: سيتم إضافة خيارات التواصل قريباً

# welcome
source: Welcome to Notes App
ar: مرحباً بك في تطبيق الملاحظات

source: No pages yet
ar: لا توجد صفحات بعد

# createFirstPage
source: Start by creating your first page
ar: ابدأ بإنشاء صفحتك الأولى

source: Create New Page
ar: إنشاء صفحة جديدة

source: Add new page
ar: إضافة صفحة جديدة

source: Add new folder
ar: إضافة مجلد جديد

source: Loading data...
ar: جاري تحميل البيانات...

# allPagesTitle
source: All Pages
ar: جميع الصفحات

source: Latest
ar: الأحدث

# foldersCount
source: {count, plural, =0{No folders} =1{1 folder} other{{count} folders}}
ar: {count, plural, =0{لا توجد مجلدات} =1{مجلد واحد} other{{count} مجلدات}}

# lastUpdated
source: Last updated: {when}
ar: آخر تحديث: {when}

# addPageDescription
source: Add a new page to organize your notes better
ar: أضف صفحة جديدة لتنظيم ملاحظاتك بشكل أفضل

source: Page Name
ar: اسم الصفحة

# pageNameHint
source: e.g.: Projects, Ideas, Tasks...
ar: مثال: مشاريع، أفكار، مهام...

source: Creating...
ar: جاري الإنشاء...

source: Create Page
ar: إنشاء الصفحة

source: Manage Folder:
ar: إدارة المجلد:

# unpinFolder
source: Unpin
ar: إلغاء تثبيت

source: Pin Folder
ar: تثبيت المجلد

source: Rename Folder
ar: تغيير اسم المجلد

source: Change Background Color
ar: تغيير لون الخلفية

source: Delete Folder
ar: حذف المجلد

source: Folder Name
ar: اسم المجلد

source: Confirm
ar: تأكيد

source: Select Background Color
ar: اختر لون الخلفية

source: Confirm Delete
ar: تأكيد الحذف

# deleteConfirmMessage
source: Are you sure you want to delete the folder "{folderName}"? All notes inside it will be deleted.
ar: هل أنت متأكد من حذف المجلد "{folderName}"؟ سيتم حذف جميع الملاحظات الموجودة فيه.

source: Delete
ar: حذف

source: No folders
ar: لا توجد مجلدات

source: No notes
ar: لا توجد ملاحظات

source: No folders yet
ar: لا توجد مجلدات بعد

# tapPlusToAddFolder
source: Tap + to add a new folder
ar: انقر على + لإضافة مجلد جديد

source: Error
ar: خطأ

source: Folder not found
ar: المجلد غير موجود

# daysAgo
source: {count, plural, =1{1 day ago} other{{count} days ago}}
ar: منذ {count} {count, plural, =1{يوم} other{أيام}}

# hoursAgo
source: {count, plural, =1{1 hour ago} other{{count} hours ago}}
ar: منذ {count} {count, plural, =1{ساعة} other{ساعات}}

# minutesAgo
source: {count, plural, =1{1 minute ago} other{{count} minutes ago}}
ar: منذ {count} {count, plural, =1{دقيقة} other{دقائق}}

source: Now
ar: الآن

# splashWelcomeTitle
source: Welcome to Notes App
ar: مرحباً بك في تطبيق الملاحظات

# splashTagline
source: Organize your ideas and notes easily
ar: نظّم أفكارك وملاحظاتك بسهولة

# splashLoading
source: Loading...
ar: جاري التحميل...

# onboardingPage1Title
source: Full Control
ar: تحكم كامل

# onboardingPage1Description
source: Create and organize your notes easily within pages and folders.
ar: قم بإنشاء وتنظيم ملاحظاتك بكل سهولة داخل صفحات ومجلدات.

# onboardingPage2Title
source: Simple Interface
ar: واجهة بسيطة

# onboardingPage2Description
source: Enjoy a clean and easy-to-use user interface.
ar: استمتع بواجهة مستخدم نظيفة وسهلة الاستخدام.

# onboardingPage3Title
source: Theme Customization
ar: تخصيص المظهر

# onboardingPage3Description
source: Choose between light and dark modes as you prefer.
ar: اختر بين الوضع الفاتح والداكن حسب رغبتك.

# onboardingPage4Title
source: Offline Ready
ar: عمل دون إنترنت

# onboardingPage4Description
source: The app works offline and stores notes locally to ensure privacy.
ar: التطبيق يعمل دون اتصال بالإنترنت ويخزن ملاحظاتك محلياً لضمان خصوصية عالية.

# onboardingPage5Title
source: Multiple Languages
ar: اللغات المتوفرة

# onboardingPage5Description
source: Arabic, French, and English supported for flexibility.
ar: العربية، الفرنسية، والإنجليزية لتجربة أكثر سهولة ومرونة.

# onboardingPage6Title
source: Backup & Restore
ar: النسخ والاستعادة

# onboardingPage6Description
source: Future updates will add backup and restore; without backup notes may be lost if app is removed.
ar: تتوفر تحديثات مستقبلية لنسخ البيانات واستعادتها، وإذا حُذف التطبيق دون نسخ احتياطي ستُفقد الملاحظات.

# onboardingPage7Title
source: Folder Protection
ar: حماية المجلدات

# onboardingPage7Description
source: Set a PIN for folders to keep your private notes safe.
ar: يمكنك تعيين رمز للمجلدات لحفظ أسرارك وحمايتها.

# onboardingSkip
source: Skip
ar: تخطي

# onboardingBack
source: Back
ar: عودة

# onboardingNext
source: Next
ar: التالي

# onboardingFinish
source: Finish
ar: إنهاء

source: Folders in {page}
ar: المجلدات في {page}

# noFoldersHere
source: No folders in this page
ar: لا توجد مجلدات في هذه الصفحة

# addNoteTitleSimple
source: Add Note
ar: إضافة ملاحظة

# addNoteTitleArticle
source: New Article
ar: مقال جديد

# addNoteTitleEmail
source: New Email
ar: بريد إلكتروني جديد

# addNoteTitleChecklist
source: New Checklist
ar: قائمة تحقق جديدة

source: Save
ar: حفظ

# addFolderTitle
source: Add New Folder
ar: إضافة مجلد جديد

source: Create Folder
ar: إنشاء المجلد

# addFolderDescription
source: Add a new folder to organize notes within this page
ar: أضف مجلدًا جديدًا لتنظيم الملاحظات داخل هذه الصفحة

# inPage
source: In page: {page}
ar: في الصفحة: {page}

# folderNameHint
source: e.g.: Daily Tasks, Ideas, Meetings...
ar: مثال: مهام يومية، أفكار، اجتماعات...

# creatingFolder
source: Creating...
ar: جاري الإنشاء...

# notificationsEnabledOn
source: Notifications enabled
ar: تم تفعيل الإشعارات

# notificationsEnabledOff
source: Notifications disabled
ar: تم إيقاف الإشعارات

source: Notification Sounds
ar: أصوات الإشعارات

# notificationSoundsSubtitle
source: Default sound
ar: الصوت الافتراضي

# notificationSoundsComingSoon
source: Notification sound options will be added soon
ar: سيتم إضافة خيارات الأصوات قريباً

# autoBackupPeriodicEnabled
source: Auto backup is enabled
ar: تم تفعيل النسخ الدوري

# autoBackupLast
source: Last backup: {date}
ar: آخر نسخة: {date}

# autoBackupPeriodicEnabledSnackOn
source: Auto backup enabled (runs while app is in memory)
ar: تم تفعيل النسخ الدوري (يعمل أثناء تشغيل التطبيق)

# autoBackupPeriodicEnabledSnackOff
source: Auto backup disabled
ar: تم إيقاف النسخ الدوري

# exportBackupTitle
source: Export Backup
ar: تصدير النسخة الاحتياطية

# exportBackupSubtitle
source: Save a JSON backup file
ar: حفظ ملف JSON للنسخة الاحتياطية

# exportBackupSaved
source: Backup saved
ar: تم حفظ النسخة الاحتياطية

# exportBackupFailed
source: Failed to save backup
ar: فشل في حفظ النسخة الاحتياطية

# importBackupTitle
source: Import Backup
ar: استيراد النسخة الاحتياطية

# importBackupSubtitle
source: Pick a JSON file to import
ar: اختر ملف JSON لاستيراده

# importBackupSuccess
source: Backup imported
ar: تم استيراد النسخة الاحتياطية

# importBackupFailed
source: Failed to import file
ar: فشل في استيراد الملف

# restoreFromKeyTitle
source: Restore from internal key
ar: استعادة من المفتاح الداخلي

# restoreFromKeySubtitle
source: Restore from backup_notes_v2
ar: استعادة من backup_notes_v2

# restoreFromKeySuccess
source: Restored from internal key
ar: تمت الاستعادة من المفتاح الداخلي

# restoreFromKeyNotFound
source: No internal backup found
ar: لا توجد نسخة احتياطية داخلية

# appInfoTitle
source: App Information
ar: معلومات التطبيق

# appDescription
source: A modern and elegant notes app with dark and light theme support
ar: تطبيق ملاحظات حديث وأنيق مع دعم المظهر الداكن والفاتح

# thankYouMessage
source: Thanks for using the app! 💙
ar: شكراً لاستخدام التطبيق! 💙

# composerHint
source: Type a quick note... (or press the write icon for advanced options)
ar: اكتب ملاحظة سريعة... (أو اضغط أيقونة الكتابة للخيارات المتقدمة)

# composerSend
source: Send
ar: إرسال

# composerCreate
source: Create note
ar: إنشاء ملاحظة

# composerSavedSuccess
source: Note saved successfully ✅
ar: تم حفظ الملاحظة بنجاح ✅

# composerSavedFailure
source: Failed to save note ❌
ar: فشل في حفظ الملاحظة ❌

# composerError
source: Error: {error}
ar: خطأ: {error}

# composerOptionSimple
source: Simple note
ar: ملاحظة بسيطة

# composerOptionArticle
source: Article / long note
ar: مقال / ملاحظة طويلة

# composerOptionEmail
source: Email / formatted message
ar: بريد إلكتروني / رسالة منسقة

# composerOptionChecklist
source: Checklist / tasks
ar: قائمة تحقق / مهام

# composerOptionCancel
source: Cancel
ar: إلغاء

# noteTypeSimple
source: Simple
ar: بسيطة

# noteTypeArticle
source: Article
ar: مقال

# noteTypeEmail
source: Email
ar: بريد إلكتروني

# noteTypeChecklist
source: Checklist
ar: قائمة تحقق

# noteTypeText
source: Text
ar: نص

# noteTypeImage
source: Image
ar: صورة

# noteTypeAudio
source: Audio
ar: صوت
